; domain
(define (domain switch-light)
  (:requirements :adl)
  (:predicates
   (light-on-at ?r ?c)
   (light-off-at ?r ?c)
   (next-row ?r1 ?r2)
   (next-col ?c1 ?c2)
   (is-blank_row ?r)
   (is-blank_col ?c)
  )

    (:action turnLightOn_Middle                              ; pentru a aprinde bec apasat
    :parameters (?rcur ?ccur ?rup ?rbelow ?cleft ?cright)
    :precondition (and (light-off-at ?rcur ?ccur)            ; ledul trebuie sa fie stins
                        (next-row ?rup ?rcur)                ; randul curent este urmatorul fata de randul de sus
                        (next-row ?rcur ?rbelow)             ; randul de jos este urmatorul fata de randul curent
                        (next-col ?cleft ?ccur)              ; coloana curenta este urmatoarea fata de cea din stanga 
                        (next-col ?ccur ?cright))            ; coloana din dreapta este urmatoarea fata de cea curenta
    :effect (and (not (light-off-at ?rcur ?ccur))            ; stergem starea de bec stins la pozitia curenta
                (light-on-at ?rcur ?ccur)                    ; aprindem ledul 
                (when (and (light-off-at ?rbelow ?ccur)  )    ; cand este stins ledul de jos
                      (and (not (light-off-at ?rbelow ?ccur))
                           (light-on-at ?rbelow ?ccur))
                )
                (when (and (light-on-at ?rbelow ?ccur) )     ; cand este aprins ledul de jos
                      (and (not (light-on-at ?rbelow ?ccur))
                           (light-off-at ?rbelow ?ccur))
                )

                (when (and (light-off-at ?rup ?ccur) )     ; cand este stins ledul de sus
                      (and (not (light-off-at ?rup ?ccur))
                           (light-on-at ?rup ?ccur))
                )
                (when (and (light-on-at ?rup ?ccur)  )     ; cand este aprins ledul de sus
                      (and (not (light-on-at ?rup ?ccur))
                           (light-off-at ?rup ?ccur))
                )

                (when (and (light-off-at ?rcur ?cright))   ; cand este stins ledul din dreapta
                      (and (not (light-off-at ?rcur ?cright))
                           (light-on-at ?rcur ?cright))
                )
                (when (and (light-on-at ?rcur ?cright) )   ; cand este aprins ledul din dreapta  
                      (and (not (light-on-at ?rcur ?cright))
                           (light-off-at ?rcur ?cright))
                )

                (when (and (light-off-at ?rcur ?cleft) )  ; cand este stins ledul din stanga
                      (and (not (light-off-at ?rcur ?cleft))
                           (light-on-at ?rcur ?cleft))
                )
                (when (and (light-on-at ?rcur ?cleft) )   ; cand este aprins ledul din stanga  
                      (and (not (light-on-at ?rcur ?cleft))
                           (light-off-at ?rcur ?cleft))
                )
      )
  )
  
    (:action turnLightOff_Middle
    :parameters (?rcur ?ccur ?rup ?rbelow ?cleft ?cright)
    :precondition (and (light-on-at ?rcur ?ccur)            ; ledul trebuie sa fie stins
                        (next-row ?rup ?rcur)               ; randul curent este urmatorul fata de randul de sus
                        (next-row ?rcur ?rbelow)            ; randul de jos este urmatorul fata de randul curent
                        (next-col ?cleft ?ccur)             ; coloana curenta este urmatoarea fata de cea din stanga 
                        (next-col ?ccur ?cright))           ; coloana din dreapta este urmatoarea fata de cea curenta
    :effect (and (not (light-on-at ?rcur ?ccur))            ; stergem starea de bec stins la pozitia curenta
                (light-off-at ?rcur ?ccur)                  ; aprindem ledul 
                (when (and (light-off-at ?rbelow ?ccur)  )    ; cand este stins ledul de jos
                      (and (not (light-off-at ?rbelow ?ccur))
                           (light-on-at ?rbelow ?ccur))
                )
                (when (and (light-on-at ?rbelow ?ccur) )     ; cand este aprins ledul de jos
                      (and (not (light-on-at ?rbelow ?ccur))
                           (light-off-at ?rbelow ?ccur))
                )

                (when (and (light-off-at ?rup ?ccur) )     ; cand este stins ledul de sus
                      (and (not (light-off-at ?rup ?ccur))
                           (light-on-at ?rup ?ccur))
                )
                (when (and (light-on-at ?rup ?ccur)  )     ; cand este aprins ledul de sus
                      (and (not (light-on-at ?rup ?ccur))
                           (light-off-at ?rup ?ccur))
                )

                (when (and (light-off-at ?rcur ?cright))   ; cand este stins ledul din dreapta
                      (and (not (light-off-at ?rcur ?cright))
                           (light-on-at ?rcur ?cright))
                )
                (when (and (light-on-at ?rcur ?cright) )   ; cand este aprins ledul din dreapta  
                      (and (not (light-on-at ?rcur ?cright))
                           (light-off-at ?rcur ?cright))
                )

                (when (and (light-off-at ?rcur ?cleft) )  ; cand este stins ledul din stanga
                      (and (not (light-off-at ?rcur ?cleft))
                           (light-on-at ?rcur ?cleft))
                )
                (when (and (light-on-at ?rcur ?cleft) )   ; cand este aprins ledul din stanga  
                      (and (not (light-on-at ?rcur ?cleft))
                           (light-off-at ?rcur ?cleft))
                )
      )
   )
)

; problem
(define (problem eight-puzzle-from-figure)
  (:domain switch-light)
  (:objects
     light1 light2 light3 
     light4 light5 light6 
     light7 light8 light9

     row0 row1 row2 row3 row4 row5 row6
     col0 col1 col2 col3 col4 col5 col6)
  (:init
     (next-row row0 row1)          (next-col col0 col1)
     (next-row row1 row2)          (next-col col1 col2)
     (next-row row2 row3)          (next-col col2 col3)
     (next-row row3 row4)          (next-col col3 col4)
     (next-row row4 row5)          (next-col col4 col5)
     (next-row row5 row6)          (next-col col5 col6)

     (light-on-at row1 col1)     
     (light-on-at row1 col2)
     (light-on-at row1 col3) 
     (light-on-at row1 col4)
     (light-on-at row1 col5)      

     (light-on-at row2 col1)     
     (light-on-at row2 col2)
     (light-on-at row2 col3) 
     (light-on-at row2 col4)
     (light-on-at row2 col5)      

     (light-on-at row3 col1)     
     (light-on-at row3 col2)
     (light-on-at row3 col3) 
     (light-on-at row3 col4)
     (light-on-at row3 col5)
     
     (light-on-at row4 col1)     
     (light-on-at row4 col2)
     (light-on-at row4 col3) 
     (light-on-at row4 col4)
     (light-on-at row4 col5)    

     (light-on-at row5 col1)     
     (light-on-at row5 col2)
     (light-on-at row5 col3) 
     (light-on-at row5 col4)
     (light-on-at row5 col5)    

     (is-blank_col col0)
     (is-blank_col col6)

     (is-blank_row row0)
     (is-blank_row row6)
   )
  (:goal
   (and
    (is-blank_col col0)
    (is-blank_col col6)
    (is-blank_row row0)
    (is-blank_row row6)

     (light-off-at row1 col1)     
     (light-off-at row1 col2)
     (light-off-at row1 col3) 
     (light-off-at row1 col4)
     (light-off-at row1 col5)      

     (light-off-at row2 col1)     
     (light-off-at row2 col2)
     (light-off-at row2 col3) 
     (light-off-at row2 col4)
     (light-off-at row2 col5)      

     (light-off-at row3 col1)     
     (light-off-at row3 col2)
     (light-off-at row3 col3) 
     (light-off-at row3 col4)
     (light-off-at row3 col5)
     
     (light-off-at row4 col1)     
     (light-off-at row4 col2)
     (light-off-at row4 col3) 
     (light-off-at row4 col4)
     (light-off-at row4 col5)    

     (light-off-at row5 col1)     
     (light-off-at row5 col2)
     (light-off-at row5 col3) 
     (light-off-at row5 col4)
     (light-off-at row5 col5)   
    )
   )

   )

; plan
1. (turnlightoff_middle row1 col1 row0 row2 col0 col2)
   deleted: (light-on-at row1 col1) (light-on-at row2 col1) (light-on-at row1 col2)
   added: (light-off-at row1 col1) (light-off-at row2 col1) (light-off-at row1 col2)
   goals met: 7 of 29
2. (turnlightoff_middle row1 col5 row0 row2 col4 col6)
   deleted: (light-on-at row1 col5) (light-on-at row2 col5) (light-on-at row1 col4)
   added: (light-off-at row1 col5) (light-off-at row2 col5) (light-off-at row1 col4)
   goals met: 10 of 29
3. (turnlightoff_middle row5 col1 row4 row6 col0 col2)
   deleted: (light-on-at row5 col1) (light-on-at row4 col1) (light-on-at row5 col2)
   added: (light-off-at row5 col1) (light-off-at row4 col1) (light-off-at row5 col2)
   goals met: 13 of 29
4. (turnlightoff_middle row5 col5 row4 row6 col4 col6)
   deleted: (light-on-at row5 col5) (light-on-at row4 col5) (light-on-at row5 col4)
   added: (light-off-at row5 col5) (light-off-at row4 col5) (light-off-at row5 col4)
   goals met: 16 of 29
5. (turnlightoff_middle row2 col2 row1 row3 col1 col3)
   deleted: (light-on-at row2 col2) (light-on-at row3 col2) (light-off-at row1 col2) (light-on-at row2 col3) (light-off-at row2 col1)
   added: (light-off-at row2 col2) (light-off-at row3 col2) (light-on-at row1 col2) (light-off-at row2 col3) (light-on-at row2 col1)
   goals met: 17 of 29
6. (turnlightoff_middle row4 col4 row3 row5 col3 col5)
   deleted: (light-on-at row4 col4) (light-off-at row5 col4) (light-on-at row3 col4) (light-off-at row4 col5) (light-on-at row4 col3)
   added: (light-off-at row4 col4) (light-on-at row5 col4) (light-off-at row3 col4) (light-on-at row4 col5) (light-off-at row4 col3)
   goals met: 18 of 29
7. (turnlightoff_middle row1 col2 row0 row2 col1 col3)
   deleted: (light-on-at row1 col2) (light-off-at row2 col2) (light-on-at row1 col3) (light-off-at row1 col1)
   added: (light-off-at row1 col2) (light-on-at row2 col2) (light-off-at row1 col3) (light-on-at row1 col1)
   goals met: 18 of 29
8. (turnlightoff_middle row1 col1 row0 row2 col0 col2)
   deleted: (light-on-at row1 col1) (light-on-at row2 col1) (light-off-at row1 col2)
   added: (light-off-at row1 col1) (light-off-at row2 col1) (light-on-at row1 col2)
   goals met: 19 of 29
9. (turnlightoff_middle row4 col5 row3 row5 col4 col6)
   deleted: (light-on-at row4 col5) (light-off-at row5 col5) (light-on-at row3 col5) (light-off-at row4 col4)
   added: (light-off-at row4 col5) (light-on-at row5 col5) (light-off-at row3 col5) (light-on-at row4 col4)
   goals met: 19 of 29
10. (turnlightoff_middle row5 col4 row4 row6 col3 col5)
   deleted: (light-on-at row5 col4) (light-on-at row4 col4) (light-on-at row5 col5) (light-on-at row5 col3)
   added: (light-off-at row5 col4) (light-off-at row4 col4) (light-off-at row5 col5) (light-off-at row5 col3)
   goals met: 23 of 29
11. (turnlightoff_middle row2 col2 row1 row3 col1 col3)
   deleted: (light-on-at row2 col2) (light-off-at row3 col2) (light-on-at row1 col2) (light-off-at row2 col3) (light-off-at row2 col1)
   added: (light-off-at row2 col2) (light-on-at row3 col2) (light-off-at row1 col2) (light-on-at row2 col3) (light-on-at row2 col1)
   goals met: 22 of 29
12. (turnlightoff_middle row3 col1 row2 row4 col0 col2)
   deleted: (light-on-at row3 col1) (light-off-at row4 col1) (light-on-at row2 col1) (light-on-at row3 col2)
   added: (light-off-at row3 col1) (light-on-at row4 col1) (light-off-at row2 col1) (light-off-at row3 col2)
   goals met: 24 of 29
13. (turnlightoff_middle row2 col3 row1 row3 col2 col4)
   deleted: (light-on-at row2 col3) (light-on-at row3 col3) (light-off-at row1 col3) (light-on-at row2 col4) (light-off-at row2 col2)
   added: (light-off-at row2 col3) (light-off-at row3 col3) (light-on-at row1 col3) (light-off-at row2 col4) (light-on-at row2 col2)
   goals met: 25 of 29
14. (turnlightoff_middle row4 col1 row3 row5 col0 col2)
   deleted: (light-on-at row4 col1) (light-off-at row5 col1) (light-off-at row3 col1) (light-on-at row4 col2)
   added: (light-off-at row4 col1) (light-on-at row5 col1) (light-on-at row3 col1) (light-off-at row4 col2)
   goals met: 25 of 29
15. (turnlightoff_middle row5 col1 row4 row6 col0 col2)
   deleted: (light-on-at row5 col1) (light-off-at row4 col1) (light-off-at row5 col2)
   added: (light-off-at row5 col1) (light-on-at row4 col1) (light-on-at row5 col2)
   goals met: 24 of 29
16. (turnlightoff_middle row3 col1 row2 row4 col0 col2)
   deleted: (light-on-at row3 col1) (light-on-at row4 col1) (light-off-at row2 col1) (light-off-at row3 col2)
   added: (light-off-at row3 col1) (light-off-at row4 col1) (light-on-at row2 col1) (light-on-at row3 col2)
   goals met: 24 of 29
17. (turnlightoff_middle row2 col2 row1 row3 col1 col3)
   deleted: (light-on-at row2 col2) (light-on-at row3 col2) (light-off-at row1 col2) (light-off-at row2 col3) (light-on-at row2 col1)
   added: (light-off-at row2 col2) (light-off-at row3 col2) (light-on-at row1 col2) (light-on-at row2 col3) (light-off-at row2 col1)
   goals met: 25 of 29
18. (turnlightoff_middle row1 col2 row0 row2 col1 col3)
   deleted: (light-on-at row1 col2) (light-off-at row2 col2) (light-on-at row1 col3) (light-off-at row1 col1)
   added: (light-off-at row1 col2) (light-on-at row2 col2) (light-off-at row1 col3) (light-on-at row1 col1)
   goals met: 25 of 29
19. (turnlightoff_middle row1 col1 row0 row2 col0 col2)
   deleted: (light-on-at row1 col1) (light-off-at row2 col1) (light-off-at row1 col2)
   added: (light-off-at row1 col1) (light-on-at row2 col1) (light-on-at row1 col2)
   goals met: 24 of 29
20. (turnlightoff_middle row2 col2 row1 row3 col1 col3)
   deleted: (light-on-at row2 col2) (light-off-at row3 col2) (light-on-at row1 col2) (light-on-at row2 col3) (light-on-at row2 col1)
   added: (light-off-at row2 col2) (light-on-at row3 col2) (light-off-at row1 col2) (light-off-at row2 col3) (light-off-at row2 col1)
   goals met: 27 of 29
21. (turnlightoff_middle row5 col2 row4 row6 col1 col3)
   deleted: (light-on-at row5 col2) (light-off-at row4 col2) (light-off-at row5 col3) (light-off-at row5 col1)
   added: (light-off-at row5 col2) (light-on-at row4 col2) (light-on-at row5 col3) (light-on-at row5 col1)
   goals met: 25 of 29
22. (turnlightoff_middle row5 col1 row4 row6 col0 col2)
   deleted: (light-on-at row5 col1) (light-off-at row4 col1) (light-off-at row5 col2)
   added: (light-off-at row5 col1) (light-on-at row4 col1) (light-on-at row5 col2)
   goals met: 24 of 29
23. (turnlightoff_middle row5 col2 row4 row6 col1 col3)
   deleted: (light-on-at row5 col2) (light-on-at row4 col2) (light-on-at row5 col3) (light-off-at row5 col1)
   added: (light-off-at row5 col2) (light-off-at row4 col2) (light-off-at row5 col3) (light-on-at row5 col1)
   goals met: 26 of 29
24. (turnlightoff_middle row4 col1 row3 row5 col0 col2)
   deleted: (light-on-at row4 col1) (light-on-at row5 col1) (light-off-at row3 col1) (light-off-at row4 col2)
   added: (light-off-at row4 col1) (light-off-at row5 col1) (light-on-at row3 col1) (light-on-at row4 col2)
   goals met: 26 of 29
25. (turnlightoff_middle row4 col2 row3 row5 col1 col3)
   deleted: (light-on-at row4 col2) (light-off-at row5 col2) (light-on-at row3 col2) (light-off-at row4 col3) (light-off-at row4 col1)
   added: (light-off-at row4 col2) (light-on-at row5 col2) (light-off-at row3 col2) (light-on-at row4 col3) (light-on-at row4 col1)
   goals met: 25 of 29
26. (turnlightoff_middle row4 col1 row3 row5 col0 col2)
   deleted: (light-on-at row4 col1) (light-off-at row5 col1) (light-on-at row3 col1) (light-off-at row4 col2)
   added: (light-off-at row4 col1) (light-on-at row5 col1) (light-off-at row3 col1) (light-on-at row4 col2)
   goals met: 25 of 29
27. (turnlightoff_middle row5 col1 row4 row6 col0 col2)
   deleted: (light-on-at row5 col1) (light-off-at row4 col1) (light-on-at row5 col2)
   added: (light-off-at row5 col1) (light-on-at row4 col1) (light-off-at row5 col2)
   goals met: 26 of 29
28. (turnlightoff_middle row4 col1 row3 row5 col0 col2)
   deleted: (light-on-at row4 col1) (light-off-at row5 col1) (light-off-at row3 col1) (light-on-at row4 col2)
   added: (light-off-at row4 col1) (light-on-at row5 col1) (light-on-at row3 col1) (light-off-at row4 col2)
   goals met: 26 of 29
29. (turnlightoff_middle row3 col1 row2 row4 col0 col2)
   deleted: (light-on-at row3 col1) (light-off-at row4 col1) (light-off-at row2 col1) (light-off-at row3 col2)
   added: (light-off-at row3 col1) (light-on-at row4 col1) (light-on-at row2 col1) (light-on-at row3 col2)
   goals met: 24 of 29
30. (turnlightoff_middle row4 col1 row3 row5 col0 col2)
   deleted: (light-on-at row4 col1) (light-on-at row5 col1) (light-off-at row3 col1) (light-off-at row4 col2)
   added: (light-off-at row4 col1) (light-off-at row5 col1) (light-on-at row3 col1) (light-on-at row4 col2)
   goals met: 24 of 29
31. (turnlightoff_middle row3 col2 row2 row4 col1 col3)
   deleted: (light-on-at row3 col2) (light-on-at row4 col2) (light-off-at row2 col2) (light-off-at row3 col3) (light-on-at row3 col1)
   added: (light-off-at row3 col2) (light-off-at row4 col2) (light-on-at row2 col2) (light-on-at row3 col3) (light-off-at row3 col1)
   goals met: 25 of 29
32. (turnlightoff_middle row2 col2 row1 row3 col1 col3)
   deleted: (light-on-at row2 col2) (light-off-at row3 col2) (light-off-at row1 col2) (light-off-at row2 col3) (light-on-at row2 col1)
   added: (light-off-at row2 col2) (light-on-at row3 col2) (light-on-at row1 col2) (light-on-at row2 col3) (light-off-at row2 col1)
   goals met: 24 of 29
33. (turnlightoff_middle row3 col3 row2 row4 col2 col4)
   deleted: (light-on-at row3 col3) (light-on-at row4 col3) (light-on-at row2 col3) (light-off-at row3 col4) (light-on-at row3 col2)
   added: (light-off-at row3 col3) (light-off-at row4 col3) (light-off-at row2 col3) (light-on-at row3 col4) (light-off-at row3 col2)
   goals met: 27 of 29
34. (turnlighton_middle row1 col3 row0 row2 col2 col4)
   deleted: (light-off-at row1 col3) (light-off-at row2 col3) (light-off-at row1 col4) (light-on-at row1 col2)
   added: (light-on-at row1 col3) (light-on-at row2 col3) (light-on-at row1 col4) (light-off-at row1 col2)
   goals met: 25 of 29
35. (turnlightoff_middle row1 col4 row0 row2 col3 col5)
   deleted: (light-on-at row1 col4) (light-off-at row2 col4) (light-off-at row1 col5) (light-on-at row1 col3)
   added: (light-off-at row1 col4) (light-on-at row2 col4) (light-on-at row1 col5) (light-off-at row1 col3)
   goals met: 25 of 29
36. (turnlightoff_middle row2 col4 row1 row3 col3 col5)
   deleted: (light-on-at row2 col4) (light-on-at row3 col4) (light-off-at row1 col4) (light-off-at row2 col5) (light-on-at row2 col3)
   added: (light-off-at row2 col4) (light-off-at row3 col4) (light-on-at row1 col4) (light-on-at row2 col5) (light-off-at row2 col3)
   goals met: 26 of 29
37. (turnlightoff_middle row1 col5 row0 row2 col4 col6)
   deleted: (light-on-at row1 col5) (light-on-at row2 col5) (light-on-at row1 col4)
   added: (light-off-at row1 col5) (light-off-at row2 col5) (light-off-at row1 col4)
   goals met: 29 of 29
